---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingNotConnectedError
source: html/5c28c137-8545-8ab2-e104-1da715b3e483.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingNotConnectedError Property

The Railing line must be a single connected Sketch. If you want separate pieces of Railing, create two or more separate Railings.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailingNotConnectedError { get; }
```